scripts/exp2/redis-sls-600-06.txt
====== PING_INLINE ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.00% <= 0.4 milliseconds
0.16% <= 0.5 milliseconds
5.06% <= 0.6 milliseconds
42.69% <= 0.7 milliseconds
86.31% <= 0.8 milliseconds
97.60% <= 0.9 milliseconds
98.80% <= 1.0 milliseconds
99.06% <= 1.1 milliseconds
99.21% <= 1.2 milliseconds
99.26% <= 1.3 milliseconds
99.29% <= 1.4 milliseconds
99.33% <= 1.5 milliseconds
99.36% <= 1.6 milliseconds
99.40% <= 1.7 milliseconds
99.44% <= 1.8 milliseconds
99.48% <= 1.9 milliseconds
99.52% <= 2.0 milliseconds
99.52% <= 2 milliseconds
99.68% <= 3 milliseconds
99.74% <= 4 milliseconds
99.75% <= 11 milliseconds
99.78% <= 12 milliseconds
99.85% <= 13 milliseconds
99.85% <= 14 milliseconds
99.86% <= 15 milliseconds
99.90% <= 16 milliseconds
99.94% <= 17 milliseconds
99.96% <= 18 milliseconds
100.00% <= 18 milliseconds
36791.76 requests per second

====== PING_BULK ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.36% <= 1 milliseconds
99.62% <= 2 milliseconds
99.77% <= 3 milliseconds
99.80% <= 4 milliseconds
99.80% <= 13 milliseconds
99.81% <= 14 milliseconds
99.85% <= 21 milliseconds
99.90% <= 22 milliseconds
100.00% <= 23 milliseconds
36737.70 requests per second

====== SET ======
  100000 requests completed in 2.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.37% <= 1 milliseconds
99.67% <= 2 milliseconds
99.75% <= 3 milliseconds
99.80% <= 4 milliseconds
99.81% <= 5 milliseconds
99.85% <= 7 milliseconds
99.90% <= 8 milliseconds
99.90% <= 11 milliseconds
99.92% <= 12 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
37202.38 requests per second

====== GET ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.15% <= 1 milliseconds
99.51% <= 2 milliseconds
99.72% <= 3 milliseconds
99.76% <= 4 milliseconds
99.79% <= 5 milliseconds
99.85% <= 6 milliseconds
99.85% <= 11 milliseconds
99.92% <= 12 milliseconds
99.95% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 19 milliseconds
36968.58 requests per second

====== INCR ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.37% <= 1 milliseconds
99.67% <= 2 milliseconds
99.75% <= 4 milliseconds
99.76% <= 5 milliseconds
99.80% <= 16 milliseconds
99.82% <= 17 milliseconds
99.85% <= 21 milliseconds
99.90% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 23 milliseconds
36724.20 requests per second

====== LPUSH ======
  100000 requests completed in 2.71 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.26% <= 1 milliseconds
99.61% <= 2 milliseconds
99.75% <= 3 milliseconds
99.79% <= 4 milliseconds
99.80% <= 11 milliseconds
99.83% <= 12 milliseconds
99.88% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 21 milliseconds
99.98% <= 22 milliseconds
100.00% <= 22 milliseconds
36859.56 requests per second

====== RPUSH ======
  100000 requests completed in 2.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.23% <= 1 milliseconds
99.62% <= 2 milliseconds
99.75% <= 3 milliseconds
99.80% <= 4 milliseconds
99.80% <= 11 milliseconds
99.81% <= 12 milliseconds
99.90% <= 13 milliseconds
99.90% <= 15 milliseconds
99.94% <= 16 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
37174.72 requests per second

====== LPOP ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.03% <= 1 milliseconds
99.54% <= 2 milliseconds
99.74% <= 3 milliseconds
99.80% <= 4 milliseconds
99.80% <= 6 milliseconds
99.81% <= 7 milliseconds
99.85% <= 11 milliseconds
99.90% <= 12 milliseconds
99.95% <= 22 milliseconds
100.00% <= 23 milliseconds
100.00% <= 23 milliseconds
37078.23 requests per second

====== RPOP ======
  100000 requests completed in 2.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.17% <= 1 milliseconds
99.60% <= 2 milliseconds
99.75% <= 3 milliseconds
99.78% <= 4 milliseconds
99.80% <= 5 milliseconds
99.85% <= 11 milliseconds
99.89% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
37202.38 requests per second

====== SADD ======
  100000 requests completed in 2.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.01% <= 1 milliseconds
99.61% <= 2 milliseconds
99.75% <= 3 milliseconds
99.80% <= 5 milliseconds
99.85% <= 6 milliseconds
99.85% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 13 milliseconds
99.94% <= 14 milliseconds
99.95% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 18 milliseconds
37243.95 requests per second

====== HSET ======
  100000 requests completed in 2.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.31% <= 1 milliseconds
99.64% <= 2 milliseconds
99.75% <= 4 milliseconds
99.78% <= 5 milliseconds
99.80% <= 6 milliseconds
99.85% <= 7 milliseconds
99.85% <= 11 milliseconds
99.89% <= 12 milliseconds
99.92% <= 13 milliseconds
99.95% <= 21 milliseconds
99.98% <= 22 milliseconds
100.00% <= 22 milliseconds
37299.52 requests per second

====== SPOP ======
  100000 requests completed in 2.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.03% <= 1 milliseconds
99.54% <= 2 milliseconds
99.76% <= 3 milliseconds
99.82% <= 4 milliseconds
99.85% <= 7 milliseconds
99.86% <= 8 milliseconds
99.90% <= 11 milliseconds
99.96% <= 12 milliseconds
100.00% <= 12 milliseconds
36205.65 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.53% <= 1 milliseconds
99.54% <= 2 milliseconds
99.70% <= 3 milliseconds
99.77% <= 4 milliseconds
99.78% <= 5 milliseconds
99.80% <= 6 milliseconds
99.80% <= 15 milliseconds
99.82% <= 16 milliseconds
99.85% <= 17 milliseconds
99.90% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
35612.54 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

79.10% <= 1 milliseconds
99.39% <= 2 milliseconds
99.63% <= 3 milliseconds
99.73% <= 4 milliseconds
99.75% <= 5 milliseconds
99.78% <= 6 milliseconds
99.80% <= 11 milliseconds
99.80% <= 12 milliseconds
99.87% <= 13 milliseconds
99.90% <= 14 milliseconds
99.92% <= 15 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 20 milliseconds
28818.44 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.10% <= 2 milliseconds
99.30% <= 3 milliseconds
99.45% <= 4 milliseconds
99.51% <= 5 milliseconds
99.53% <= 6 milliseconds
99.54% <= 7 milliseconds
99.55% <= 8 milliseconds
99.55% <= 10 milliseconds
99.56% <= 11 milliseconds
99.58% <= 12 milliseconds
99.65% <= 13 milliseconds
99.71% <= 14 milliseconds
99.75% <= 15 milliseconds
99.75% <= 16 milliseconds
99.76% <= 17 milliseconds
99.79% <= 18 milliseconds
99.84% <= 19 milliseconds
99.88% <= 20 milliseconds
99.90% <= 21 milliseconds
99.92% <= 22 milliseconds
99.96% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 24 milliseconds
18102.82 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.05 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
98.25% <= 2 milliseconds
99.35% <= 3 milliseconds
99.48% <= 4 milliseconds
99.61% <= 5 milliseconds
99.64% <= 6 milliseconds
99.66% <= 7 milliseconds
99.69% <= 8 milliseconds
99.70% <= 9 milliseconds
99.73% <= 10 milliseconds
99.76% <= 11 milliseconds
99.79% <= 12 milliseconds
99.83% <= 13 milliseconds
99.84% <= 14 milliseconds
99.85% <= 15 milliseconds
99.86% <= 16 milliseconds
99.88% <= 17 milliseconds
99.89% <= 18 milliseconds
99.90% <= 19 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
99.93% <= 23 milliseconds
99.96% <= 24 milliseconds
99.98% <= 25 milliseconds
99.99% <= 26 milliseconds
100.00% <= 26 milliseconds
14176.35 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.90 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
61.58% <= 2 milliseconds
99.91% <= 3 milliseconds
99.96% <= 4 milliseconds
99.97% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12664.64 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.32% <= 1 milliseconds
99.89% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
35803.80 requests per second